Repository: BurakGuven1/ShopCaseStudy
Catalog: src/Api/Resources/SharedResource.*.resx
Languages: tr_tr

# Error_Generic
source: An unexpected error occurred. Please contact support and provide the trace ID.
tr_tr: Beklenmeyen bir hata oluştu. Lütfen destek ekibiyle iletişime geçin ve işlem ID'sini bildirin.

# Error_Unauthorized
source: Authentication is required to access this resource.
tr_tr: Bu kaynağa erişim için kimlik doğrulaması gereklidir.

# Error_Forbidden
source: You do not have permission to perform this action.
tr_tr: Bu işlemi gerçekleştirmek için yetkiniz bulunmamaktadır.

# Error_Validation
source: One or more validation errors occurred.
tr_tr: Bir veya daha fazla doğrulama hatası oluştu.

# Error_ResourceNotFound
source: The requested resource could not be found.
tr_tr: İstenen kaynak bulunamadı.

# Error_ProductNotFound
source: The product with the specified ID was not found.
tr_tr: Belirtilen ID'ye sahip ürün bulunamadı.

# Error_OrderNotFound
source: The order with the specified ID was not found.
tr_tr: Belirtilen ID'ye sahip sipariş bulunamadı.

# Error_Conflict
source: A conflict occurred with the current state of the resource.
tr_tr: Kaynağın mevcut durumuyla bir çakışma meydana geldi.

# Error_OrderShippedCannotCancel
source: The order cannot be canceled because it has already been shipped.
tr_tr: Sipariş daha önce kargolandığı için iptal edilemez.

# Error_InvalidCredentials
source: Invalid email or password.
tr_tr: Geçersiz e-posta veya parola.
